handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_lcd.c
    /*Clear lcd ram register*/
    for(counter = LCD_RAM1_COM0; counter <= LCD_RAM2_COM7; counter++)
    {
        LCD->RAM_COM[counter] = 0x0U;
    }
}


/**
*\*\name    LCD_Update_Request.
*\*\fun     Display request LCD update.
*\*\return  none
**/
void LCD_Update_Request(void)
{
    /* set LCD_STS UDR bit*/
    LCD->STS |= LCD_FLAG_UDR;
}

/**
*\*\name    LCD_Wait_For_Synchro.
*\*\fun     Wait until the LCD FCTRL register is synchronized in the LCDCLK domain.
*\*\        This function must be called after any write operation to LCD_FCTRL register.
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_FCRSF : synchronization  timeout
*\*\          - LCD_ERROR_OK    : synchronization  success
**/
LCD_ErrorTypeDef LCD_WaitForSynchro(void)
{
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;
    uint32_t timeout;

    /* Loop until FCRSF flag is set */
    timeout = 0;
    while(RESET == (LCD_GetFlagSTS(LCD_FLAG_FCRSF)))
    {
        timeout++;
        if(timeout >= LCD_TIME_OUT)
        {
            status_value = LCD_ERROR_FCRSF;
            break;
        }
    }
    return status_value;
}

/**
*\*\name    LCD_Init.
*\*\fun     Initialize the LCD peripheral according to the specified parameters in the LCD_InitStruct.
*\*\param   LCD_InitStructure(The input parameters must be the following values) :
*\*\          - Bias
*\*\            - LCD_BIAS_1_2              
*\*\            - LCD_BIAS_1_3            
*\*\            - LCD_BIAS_1_4   
*\*\          - BlinkFreq
*\*\            - LCD_BLINKFREQ_DIV_8  
*\*\            - LCD_BLINKFREQ_DIV_16
*\*\            - LCD_BLINKFREQ_DIV_32  
*\*\            - LCD_BLINKFREQ_DIV_64
*\*\            - LCD_BLINKFREQ_DIV_128  
*\*\            - LCD_BLINKFREQ_DIV_256
*\*\            - LCD_BLINKFREQ_DIV_512  
*\*\            - LCD_BLINKFREQ_DIV_1024
*\*\          - BlinkMode
*\*\            - LCD_BLINKMODE_OFF        
*\*\            - LCD_BLINKMODE_SEG0_COM0       
*\*\            - LCD_BLINKMODE_SEG0_ALLCOM
*\*\            - LCD_BLINKMODE_ALLSEG_ALLCOM
*\*\          - Contrast:
*\*\            - LCD_CONTRASTLEVEL_0
*\*\            - LCD_CONTRASTLEVEL_1 
*\*\            - LCD_CONTRASTLEVEL_2
*\*\            - LCD_CONTRASTLEVEL_3 
*\*\            - LCD_CONTRASTLEVEL_4
*\*\            - LCD_CONTRASTLEVEL_5 
*\*\            - LCD_CONTRASTLEVEL_6
*\*\            - LCD_CONTRASTLEVEL_7
*\*\            - LCD_CONTRASTLEVEL_8
*\*\            - LCD_CONTRASTLEVEL_9 
*\*\            - LCD_CONTRASTLEVEL_10
*\*\            - LCD_CONTRASTLEVEL_11
*\*\            - LCD_CONTRASTLEVEL_12
*\*\            - LCD_CONTRASTLEVEL_13 
*\*\            - LCD_CONTRASTLEVEL_14
*\*\            - LCD_CONTRASTLEVEL_15
*\*\          - DeadTime:
*\*\            - LCD_DEADTIME_0
*\*\            - LCD_DEADTIME_1 
*\*\            - LCD_DEADTIME_2
*\*\            - LCD_DEADTIME_3 
*\*\            - LCD_DEADTIME_4
*\*\            - LCD_DEADTIME_5 
*\*\            - LCD_DEADTIME_6
*\*\            - LCD_DEADTIME_7
*\*\          - Divider:
*\*\            - LCD_DIV_16
*\*\            - LCD_DIV_17 
*\*\            - LCD_DIV_18
*\*\            - LCD_DIV_19 
*\*\            - LCD_DIV_20
*\*\            - LCD_DIV_21 
*\*\            - LCD_DIV_22
*\*\            - LCD_DIV_23
*\*\            - LCD_DIV_24
*\*\            - LCD_DIV_25 
*\*\            - LCD_DIV_26
*\*\            - LCD_DIV_27
*\*\            - LCD_DIV_28
*\*\            - LCD_DIV_29 
*\*\            - LCD_DIV_30
*\*\            - LCD_DIV_31
*\*\          - Duty:
*\*\            - LCD_DUTY_STATIC
*\*\            - LCD_DUTY_1_2 
*\*\            - LCD_DUTY_1_3
*\*\            - LCD_DUTY_1_4 
*\*\            - LCD_DUTY_1_8
*\*\          - HighDrive:
*\*\            - LCD_HIGHDRIVE_DISABLE
*\*\            - LCD_HIGHDRIVE_ENABLE 
*\*\          - HighDriveBuffer:
*\*\            - LCD_HIGHDRIVEBUFFER_DISABLE
*\*\            - LCD_HIGHDRIVEBUFFER_ENABLE
*\*\          - Prescaler:
*\*\            - LCD_PRESCALER_1
*\*\            - LCD_PRESCALER_2 
*\*\            - LCD_PRESCALER_4
*\*\            - LCD_PRESCALER_8 
*\*\            - LCD_PRESCALER_16
*\*\            - LCD_PRESCALER_32 
*\*\            - LCD_PRESCALER_64
*\*\            - LCD_PRESCALER_128
*\*\            - LCD_PRESCALER_256
*\*\            - LCD_PRESCALER_512 
*\*\            - LCD_PRESCALER_1024
*\*\            - LCD_PRESCALER_2048
*\*\            - LCD_PRESCALER_4096
*\*\            - LCD_PRESCALER_8192 
*\*\            - LCD_PRESCALER_16384
*\*\            - LCD_PRESCALER_32768
*\*\          - PulseOnDuration:
*\*\            - LCD_PULSEONDURATION_0
*\*\            - LCD_PULSEONDURATION_1 
*\*\            - LCD_PULSEONDURATION_2
*\*\            - LCD_PULSEONDURATION_3 
*\*\            - LCD_PULSEONDURATION_4
*\*\            - LCD_PULSEONDURATION_5 
*\*\            - LCD_PULSEONDURATION_6
*\*\            - LCD_PULSEONDURATION_7
*\*\          - VoltageSource:
*\*\            - LCD_VOLTAGESOURCE_DISABLE
*\*\            - LCD_VOLTAGESOURCE_ENABLE
*\*\return  none
**/
LCD_ErrorTypeDef LCD_Init(LCD_InitType *LCD_InitStructure)
{
    uint32_t tmp, timeout;
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;
    /*Disable LCD controller*/
    LCD_Disable();
    
    /* set the bits of LCD_CTRL register with corresonding parameters */
    tmp = 0;
    tmp |= LCD_InitStructure->HighDriveBuffer;
    tmp |= LCD_InitStructure->Bias;
    tmp |= LCD_InitStructure->Duty;
    tmp |= LCD_InitStructure->VoltageSource;
    LCD->CTRL = tmp;

    /*If High driver enable, PulseOnDuration must be LCD_PulseOnDuration_1*/
    if(LCD_InitStructure->HighDrive == LCD_HIGHDRIVE_ENABLE)
    {
        LCD_InitStructure->PulseOnDuration = LCD_PULSEONDURATION_1;
    }

    /* set the bits of LCD_FCTRL register with corresonding parameters */
    tmp = 0;
    tmp |= LCD_InitStructure->Prescaler;
    tmp |= LCD_InitStructure->Divider;
    tmp |= LCD_InitStructure->BlinkMode;
    tmp |= LCD_InitStructure->BlinkFreq;
    tmp |= LCD_InitStructure->Contrast;
    tmp |= LCD_InitStructure->DeadTime;
    tmp |= LCD_InitStructure->HighDrive;
    tmp |= LCD_InitStructure->PulseOnDuration;
    LCD->FCTRL = tmp;

    /*Clear LCD display ram, and set the update request flag*/
    LCD_RamClear();
    LCD_Update_Request();
    
    /*Enable LCD controller*/
    LCD_Enable();

    /*Check the LCD ENSTS status*/
    timeout = 0;
    while(RESET == (LCD_GetFlagSTS(LCD_FLAG_ENSTS)))
    {
        timeout++;
        if(timeout >= LCD_TIME_OUT)
        {
            status_value = LCD_ERROR_ENSTS;
            break;
        }
        else
        {
            /* no process */
        }
    }

