handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_lcd.c
    if(status_value == LCD_ERROR_OK)
    {
        /*Wait VLCD stable*/
        timeout = 0;
        while(RESET == (LCD_GetFlagSTS(LCD_FLAG_RDY)))
        {
            timeout++;
            if(timeout >= LCD_TIME_OUT)
            {
                status_value = LCD_ERROR_RDY;
                break;
            }
            else
            {
                /* no process */
            }
        }
    }
    else
    {
        /* no process */
    }

    if(status_value == LCD_ERROR_OK)
    {
        status_value = LCD_WaitForSynchro();
    }
    else
    {
        /* no process */
    }
    
    return status_value;
}



/**
*\*\name    LCD_ENABLE_IT.
*\*\fun     Enable LCD interrupts.
*\*\param   lcd_interrupt :
*\*\          - LCD_IT_UDD    
*\*\          - LCD_IT_SOF      
*\*\return  none
**/
void LCD_ENABLE_IT(uint32_t lcd_interrupt)
{
    /* Set the LCD_FCTRL LCD_UDDIE_ENABLE/LCD_SOFIE_ENABLE bit to enable LCD interrupts */
    LCD->FCTRL |= lcd_interrupt;
}

/**
*\*\name    LCD_DISABLE_IT.
*\*\fun     Disable LCD interrupts.
*\*\param   lcd_interrupt :
*\*\          - LCD_IT_UDD    
*\*\          - LCD_IT_SOF      
*\*\return  none
**/
void LCD_DISABLE_IT(uint32_t lcd_interrupt)
{
    /* Clear the LCD_FCTRL LCD_UDDIE_DISABLE/LCD_SOFIE_DISABLE bit to enable LCD interrupts */
    LCD->FCTRL &= (~lcd_interrupt);
}


/**
*\*\name    LCD_GET_IT_SOURCE.
*\*\fun     Get LCD  interrupt flag Status.
*\*\param   lcd_interrupt :
*\*\          - LCD_IT_UDD
*\*\          - LCD_IT_SOF
*\*\return  SET or RESET
**/
FlagStatus LCD_GET_IT_SOURCE(uint32_t lcd_interrupt)
{
    FlagStatus bit_status;
    /* Check the status of LCD flag */
    if ((LCD->FCTRL & lcd_interrupt) != (uint8_t)RESET)
    {
        /* LCD_FLAG is set */
        bit_status = SET;
    }
    else
    {
        /* LCD_FLAG is reset */
        bit_status = RESET;
    }
    return bit_status;
}

/**
*\*\name    LCD_Clear_Flag.
*\*\fun     Clear lcd flag Status.
*\*\param   lcd_flag :
*\*\          - LCD_FLAG_UDD_CLEAR
*\*\          - LCD_FLAG_SOF_CLEAR
*\*\return  none
**/
void LCD_Clear_Flag(uint32_t lcd_flag)
{
    uint32_t timeout;
    /* Clear the selected LCD flag Status */
    LCD->CLR = lcd_flag; 
    /* Wait update complete */
    timeout = 0;
    while(SET == (LCD_GetFlagSTS(LCD_FLAG_UDD)))
    {
        timeout++;
        if(timeout >= LCD_TIME_OUT)
        {
            break;
        }
        else
        {
            /* no process */
        }
    }
    
    /*Clear UDDCLR bit*/
    LCD->CLR &= (~LCD_CLR_UDDCLR);
}

/**
*\*\name    LCD_UpdateDisplayRequest.
*\*\fun     LCD Display update request,and get the request status.
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_UDD : update timeout
*\*\          - LCD_ERROR_OK  : update success
**/
LCD_ErrorTypeDef LCD_UpdateDisplayRequest(void)
{
    uint32_t timeout;
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;

    /*Clear UDD flag*/
    LCD_Clear_Flag(LCD_FLAG_UDD_CLEAR);
    
    /* set update display request bit*/
    LCD_Update_Request();

    /* Wait update complete */
    timeout = 0;
    while(RESET == (LCD_GetFlagSTS(LCD_FLAG_UDD)))
    {
        timeout++;
        if(timeout >= LCD_TIME_OUT)
        {
            status_value = LCD_ERROR_UDD;
            break;
        }
        else
        {
            /* no process */
        }
    }
    
    return status_value;
}

/**
*\*\name    LCD_Write.
*\*\fun     write to the lcd ram register.
*\*\param   RAMRegisterIndex :
*\*\          - LCD_RAM1_COM0
*\*\          - LCD_RAM2_COM0
*\*\          - LCD_RAM1_COM1
*\*\          - LCD_RAM2_COM1
*\*\          - LCD_RAM1_COM2
*\*\          - LCD_RAM2_COM2
*\*\          - LCD_RAM1_COM3
*\*\          - LCD_RAM2_COM3
*\*\          - LCD_RAM1_COM4
*\*\          - LCD_RAM2_COM4
*\*\          - LCD_RAM1_COM5
*\*\          - LCD_RAM2_COM5
*\*\          - LCD_RAM1_COM6
*\*\          - LCD_RAM2_COM6
*\*\          - LCD_RAM1_COM7
*\*\          - LCD_RAM2_COM7
*\*\param   RAMRegisterMask :
*\*\          - 0x00000000U~0xFFFFFFFFU  A bit of 1 indicates that this bit retains its original value.
*\*\param   RAMData :
*\*\          - 0x00000000 ~ 0xFFFFFFFF
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_PARAM : LCD function parameter error
*\*\          - LCD_ERROR_UDR   : Update display request flag error
*\*\          - LCD_ERROR_OK    : update success
**/
LCD_ErrorTypeDef LCD_Write(uint32_t RAMRegisterIndex,uint32_t RAMRegisterMask,uint32_t RAMData)
{   
    uint32_t timeout;
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;

    if(RAMRegisterIndex > LCD_RAM2_COM7) 
    {
        status_value = LCD_ERROR_PARAM;
    }
    
    if(status_value == LCD_ERROR_OK)
    {
        /* Wait VLCD request flag  clear */
        timeout = 0;
        while(LCD_GetFlagSTS(LCD_FLAG_UDR) == SET)
        {
            timeout++;
            if(timeout >= LCD_TIME_OUT)
            {
                status_value = LCD_ERROR_UDR;
                break;
            }
        }
    }
    else
    {
    
    }

    if(status_value == LCD_ERROR_OK)
    {
        /* Write lcd RAMData */
        MODIFY_REG(LCD->RAM_COM[RAMRegisterIndex], ~(RAMRegisterMask), RAMData &(~(RAMRegisterMask)));
    }
    else
    {
    
    }

    return status_value;
}

/**
*\*\name    LCD_SetBit.
*\*\fun     Set some bits of lcd ram register.
*\*\param   RAMRegisterIndex :
*\*\          - LCD_RAM1_COM0
*\*\          - LCD_RAM2_COM0
*\*\          - LCD_RAM1_COM1
*\*\          - LCD_RAM2_COM1
*\*\          - LCD_RAM1_COM2
*\*\          - LCD_RAM2_COM2
*\*\          - LCD_RAM1_COM3
*\*\          - LCD_RAM2_COM3
*\*\          - LCD_RAM1_COM4
*\*\          - LCD_RAM2_COM4
*\*\          - LCD_RAM1_COM5
*\*\          - LCD_RAM2_COM5
*\*\          - LCD_RAM1_COM6
*\*\          - LCD_RAM2_COM6
*\*\          - LCD_RAM1_COM7
*\*\          - LCD_RAM2_COM7
*\*\param   RAMData :
*\*\          - 0x00000000 ~ 0xFFFFFFFF
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_PARAM : LCD function parameter error
*\*\          - LCD_ERROR_UDR   : Update display request flag error
*\*\          - LCD_ERROR_OK    : update success
**/
LCD_ErrorTypeDef LCD_SetBit(uint32_t RAMRegisterIndex,uint32_t RAMData)
{
    uint32_t timeout;
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;
    
    if(RAMRegisterIndex > LCD_RAM2_COM7) 
    {
        status_value = LCD_ERROR_PARAM;
    }

