handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_lcd.c
    if(status_value == LCD_ERROR_OK)
    {
        /* Wait VLCD request flag  clear */
        timeout = 0;
        while(LCD_GetFlagSTS(LCD_FLAG_UDR) == SET)
        {
            timeout++;
            if(timeout >= LCD_TIME_OUT)
            {
                status_value = LCD_ERROR_UDR;
                break;
            }
        }
    }
    else
    {
    
    }

    if(status_value == LCD_ERROR_OK)
    {
        /* Write lcd RAMData */
        SET_BIT(LCD->RAM_COM[RAMRegisterIndex], RAMData);
    }
    else
    {
    
    }
    
    return status_value;
}

/**
*\*\name    LCD_ClearBit.
*\*\fun     Clear some bits of lcd ram register.
*\*\param   RAMRegisterIndex :
*\*\          - LCD_RAM1_COM0
*\*\          - LCD_RAM2_COM0
*\*\          - LCD_RAM1_COM1
*\*\          - LCD_RAM2_COM1
*\*\          - LCD_RAM1_COM2
*\*\          - LCD_RAM2_COM2
*\*\          - LCD_RAM1_COM3
*\*\          - LCD_RAM2_COM3
*\*\          - LCD_RAM1_COM4
*\*\          - LCD_RAM2_COM4
*\*\          - LCD_RAM1_COM5
*\*\          - LCD_RAM2_COM5
*\*\          - LCD_RAM1_COM6
*\*\          - LCD_RAM2_COM6
*\*\          - LCD_RAM1_COM7
*\*\          - LCD_RAM2_COM7
*\*\param   RAMData :
*\*\          - 0x00000000 ~ 0xFFFFFFFF
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_PARAM : LCD function parameter error
*\*\          - LCD_ERROR_UDR   : Update display request flag error
*\*\          - LCD_ERROR_OK    : update success
**/
LCD_ErrorTypeDef LCD_ClearBit(uint32_t RAMRegisterIndex,uint32_t RAMData)
{
    uint32_t timeout;
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;
    
    if(RAMRegisterIndex > LCD_RAM2_COM7)
    {
        status_value = LCD_ERROR_PARAM;
    }

    if(status_value == LCD_ERROR_OK)
    {
        /* Wait VLCD request flag  clear */
        timeout = 0;
        while(LCD_GetFlagSTS(LCD_FLAG_UDR) == SET)
        {
            timeout++;
            if(timeout >= LCD_TIME_OUT)
            {
                status_value = LCD_ERROR_UDR;
                break;
            }
        }
    }

    if(status_value == LCD_ERROR_OK)
    {
        /* Write lcd RAMData */
        CLEAR_BIT(LCD->RAM_COM[RAMRegisterIndex], RAMData);
    }
    else
    {
    
    }
    
    return status_value;
}


/**
*\*\name    LCD_ClockConfig.
*\*\fun     Clear some bits of lcd ram register.
*\*\param   LCD_ClkSource :
*\*\          - LCD_CLK_SRC_HSI_DIV8:              LCD clock source is HSI_8M/8
*\*\          - LCD_CLK_SRC_HSE_DIV16:             LCD clock source is HSE/16
*\*\          - LCD_CLK_SRC_HSE_BYPASS_DIV16       LCD clock source is HSE_BYPASS/16
*\*\return  LCD_ErrorTypeDef
*\*\          - LCD_ERROR_CLK                LCD clock source fail error
*\*\          - LCD_ERROR_PARAM              LCD function parameter error
*\*\          - LCD_ERROR_OK                 update success
**/
LCD_ErrorTypeDef LCD_ClockConfig(uint32_t LCD_ClkSource)
{
    LCD_ErrorTypeDef status_value = LCD_ERROR_OK;
    if(LCD_CLK_SRC_HSI_DIV8==LCD_ClkSource)
    {
        if(RCC_GetFlagStatus(RCC_CTRL_FLAG_HSIRDF)==RESET)
        {
            RCC_EnableHsi(ENABLE);
            if(RCC_WaitHsiStable()!=SUCCESS)
            {
                status_value = LCD_ERROR_CLK;
            }
        }
    }
    else if(LCD_CLK_SRC_HSE_DIV16==LCD_ClkSource)
    {
        if(RCC_GetFlagStatus(RCC_CTRL_FLAG_HSERDF)==RESET)
        {
            RCC_ConfigHse(RCC_HSE_ENABLE);
            if(RCC_WaitHseStable()!=SUCCESS)
            {
                status_value = LCD_ERROR_CLK;
            }
        }
    }
	else if(LCD_CLK_SRC_HSE_BYPASS_DIV16 == LCD_ClkSource)
    {
        if(RCC_GetFlagStatus(RCC_CTRL_FLAG_HSERDF)==RESET)
        {
            RCC_ConfigHse(RCC_HSE_BYPASS);
            if(RCC_WaitHseStable()!=SUCCESS)
            {
                status_value = LCD_ERROR_CLK;
            }
        }
    }
    else
    {
        status_value = LCD_ERROR_PARAM;
    }

    if(LCD_CLK_SRC_HSI_DIV8==LCD_ClkSource)
    {
        /*set HSI as LCD clock source*/
        RCC_ConfigLCDClk(RCC_LCD_CLKSRC_HSI_DIV8);
    }
    else
    {
        /*set HSE as LCD clock source*/
        RCC_ConfigLCDClk(RCC_LCD_CLKSRC_HSE_DIV16);
    }

    /*Enable LCD clk*/
    RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_LCD,ENABLE);

    return status_value;
}


